#include "Header.h"

int main() {

	SetConsoleCP(1251); // Функція, яка дає змогу програмі працювати на українській мові
	SetConsoleOutputCP(1251);

	while (1) {

	cout << "Підрахунок площі прямокутника та квадрата\n1.Використовувати данні за замовчунням\n2.Ввести довжину однієї сторони прямокутника(інші данні за замовчунням)\n3.Ввести довжину сторін прямокутника(інші данні за замовчунням)\n4.Ввести всі три значення:\n";

	int x;
	cin >> x; 
	switch (x) {
		case 1:
			square(); // виклик функції 
			break;

		case 2:
			cout << "Введіть значення довжини однієї сторони прямокутника: ";
			int a1;
			cin >> a1;
			square(a1);
			break;

		case 3:
			cout << "Введіть значення довжини двох сторін прямокутника: ";
			int a2, b2;
			cin >> a2 >> b2;
			square(a2, b2);
			break;

		case 4:
			cout << "Введіть значення довжини двох сторін прямокутника та довжину сторони квадрата: ";
			int a3, b3, c3;
			cin >> a3 >> b3 >> c3;
			square(a3, b3, c3);
			break;
		}
	}
}